zevorn/qemu/hw/usb/stm32g474_usbfs.c
/*
 * STM32G474 USB full-speed device controller
 *
 * Copyright (c) 2026 Process Mission
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */

#include "qemu/osdep.h"
#include "qapi/error.h"
#include "hw/core/qdev-clock.h"
#include "hw/core/irq.h"
#include "hw/usb/stm32g474_usbfs.h"
#include "hw/core/registerfields.h"
#include "migration/vmstate.h"
#include "qemu/bitops.h"
#include "qemu/log.h"
#include "qemu/module.h"
#include "qapi/visitor.h"
#include "system/qtest.h"

REG32(EP0R, 0x00)
    FIELD(EP0R, EA, 0, 4)
    FIELD(EP0R, STAT_TX, 4, 2)
    FIELD(EP0R, DTOG_TX, 6, 1)
    FIELD(EP0R, CTR_TX, 7, 1)
    FIELD(EP0R, EP_KIND, 8, 1)
    FIELD(EP0R, EP_TYPE, 9, 2)
    FIELD(EP0R, SETUP, 11, 1)
    FIELD(EP0R, STAT_RX, 12, 2)
    FIELD(EP0R, DTOG_RX, 14, 1)
    FIELD(EP0R, CTR_RX, 15, 1)
REG32(EP1R, 0x04)
REG32(EP2R, 0x08)
REG32(EP3R, 0x0c)
REG32(EP4R, 0x10)
REG32(EP5R, 0x14)
REG32(EP6R, 0x18)
REG32(EP7R, 0x1c)

REG32(CNTR, 0x40)
    FIELD(CNTR, FRES, 0, 1)
    FIELD(CNTR, PDWN, 1, 1)
    FIELD(CNTR, LPMODE, 2, 1)
    FIELD(CNTR, FSUSP, 3, 1)
    FIELD(CNTR, RESUME, 4, 1)
    FIELD(CNTR, L1RESUME, 5, 1)
    FIELD(CNTR, L1REQM, 7, 1)
    FIELD(CNTR, ESOFM, 8, 1)
    FIELD(CNTR, SOFM, 9, 1)
    FIELD(CNTR, RESETM, 10, 1)
    FIELD(CNTR, SUSPM, 11, 1)
    FIELD(CNTR, WKUPM, 12, 1)
    FIELD(CNTR, ERRM, 13, 1)
    FIELD(CNTR, PMAOVRM, 14, 1)
    FIELD(CNTR, CTRM, 15, 1)
REG32(ISTR, 0x44)
    FIELD(ISTR, EP_ID, 0, 4)
    FIELD(ISTR, DIR, 4, 1)
    FIELD(ISTR, L1REQ, 7, 1)
    FIELD(ISTR, ESOF, 8, 1)
    FIELD(ISTR, SOF, 9, 1)
    FIELD(ISTR, RESET, 10, 1)
    FIELD(ISTR, SUSP, 11, 1)
    FIELD(ISTR, WKUP, 12, 1)
    FIELD(ISTR, ERR, 13, 1)
    FIELD(ISTR, PMAOVR, 14, 1)
    FIELD(ISTR, CTR, 15, 1)
REG32(FNR, 0x48)
REG32(DADDR, 0x4c)
    FIELD(DADDR, ADD, 0, 7)
    FIELD(DADDR, EF, 7, 1)
REG32(BTABLE, 0x50)
    FIELD(BTABLE, TABLE, 3, 13)
REG32(LPMCSR, 0x54)
    FIELD(LPMCSR, LPMEN, 0, 1)
    FIELD(LPMCSR, LPMACK, 1, 1)
REG32(BCDR, 0x58)
    FIELD(BCDR, BCDEN, 0, 1)
    FIELD(BCDR, DCDEN, 1, 1)
    FIELD(BCDR, PDEN, 2, 1)
    FIELD(BCDR, SDEN, 3, 1)
    FIELD(BCDR, DPPU, 15, 1)

#define USBFS_NUM_ENDPOINTS 8
#define USBFS_BDT_WINDOW_SIZE 64
#define USBFS_FUNCTIONAL_CLOCK_HZ 48000000
#define USBFS_EP_TYPE_BULK 0
#define USBFS_EP_TYPE_ISOCHRONOUS 2

#define USBFS_EPR_CTR_MASK \
    (R_EP0R_CTR_RX_MASK | R_EP0R_CTR_TX_MASK)
#define USBFS_EPR_TOGGLE_MASK \
    (R_EP0R_DTOG_RX_MASK | R_EP0R_STAT_RX_MASK | \
     R_EP0R_DTOG_TX_MASK | R_EP0R_STAT_TX_MASK)
#define USBFS_EPR_RW_MASK \
    (R_EP0R_EP_TYPE_MASK | R_EP0R_EP_KIND_MASK | R_EP0R_EA_MASK)
#define USBFS_ISTR_STATUS_MASK \
    (R_ISTR_PMAOVR_MASK | R_ISTR_ERR_MASK | R_ISTR_WKUP_MASK | \
     R_ISTR_SUSP_MASK | R_ISTR_RESET_MASK | R_ISTR_SOF_MASK | \
     R_ISTR_ESOF_MASK | R_ISTR_L1REQ_MASK)
#define USBFS_ISTR_DERIVED_MASK \
    (R_ISTR_CTR_MASK | R_ISTR_DIR_MASK | R_ISTR_EP_ID_MASK)
#define USBFS_LPMCSR_LINK_MASK 0x00f8
#define USBFS_BCDR_PHY_MASK 0x00f0
#define USBFS_QTEST_CTR_EP_SHIFT 16
#define USBFS_QTEST_CTR_EP_LENGTH 3

static const unsigned int stm32g474_usbfs_ep_regs[USBFS_NUM_ENDPOINTS] = {
    R_EP0R, R_EP1R, R_EP2R, R_EP3R,
    R_EP4R, R_EP5R, R_EP6R, R_EP7R,
};

static bool stm32g474_usbfs_ep_is_high_priority(uint32_t epr)
{
    unsigned int ep_type = FIELD_EX32(epr, EP0R, EP_TYPE);

    return ep_type == USBFS_EP_TYPE_ISOCHRONOUS ||
           (ep_type == USBFS_EP_TYPE_BULK &&
            (epr & R_EP0R_EP_KIND_MASK));
}

static uint32_t stm32g474_usbfs_find_pending_endpoint(
    Stm32g474UsbFsState *s, bool high_priority)
{
    for (unsigned int ep = 0; ep < USBFS_NUM_ENDPOINTS; ep++) {
        uint32_t epr = s->regs[stm32g474_usbfs_ep_regs[ep]];

        if (stm32g474_usbfs_ep_is_high_priority(epr) != high_priority) {
            continue;
        }

        if (epr & R_EP0R_CTR_RX_MASK) {
            return R_ISTR_CTR_MASK | R_ISTR_DIR_MASK | ep;
        }
        if (epr & R_EP0R_CTR_TX_MASK) {
            return R_ISTR_CTR_MASK | ep;
        }
    }

    return 0;
}

static void stm32g474_usbfs_recompute_istr(Stm32g474UsbFsState *s,
                                            uint32_t high_ctr,
                                            uint32_t low_ctr)
{
    uint32_t derived = high_ctr ? high_ctr : low_ctr;

    s->regs[R_ISTR] = (s->regs[R_ISTR] & ~USBFS_ISTR_DERIVED_MASK) |
                      derived;
}

static bool stm32g474_usbfs_clocks_valid(Stm32g474UsbFsState *s)
{
    return clock_get_hz(s->pclk) > 0 &&
           clock_get_hz(s->usb) == USBFS_FUNCTIONAL_CLOCK_HZ;
}

static bool stm32g474_usbfs_fres_asserted(Stm32g474UsbFsState *s)
{
    return (s->regs[R_CNTR] & R_CNTR_FRES_MASK) != 0;
}

static void stm32g474_usbfs_update_irqs(Stm32g474UsbFsState *s)
{
    uint32_t high_ctr;
    uint32_t low_ctr;
    bool hp_level;
    bool lp_level;

    if (s->resetting) {
        return;
    }

    high_ctr = stm32g474_usbfs_find_pending_endpoint(s, true);
    low_ctr = stm32g474_usbfs_find_pending_endpoint(s, false);
    stm32g474_usbfs_recompute_istr(s, high_ctr, low_ctr);
    if (s->peripheral_reset_asserted ||
        !stm32g474_usbfs_clocks_valid(s)) {
        qemu_set_irq(s->hp_irq, 0);
        qemu_set_irq(s->lp_irq, 0);
        return;
    }

    /*
     * RM0440 45.6.1 defines the endpoint dedicated interrupt condition as
     * independent of CNTR.CTRM. The HP output models that condition.
     */
    hp_level = high_ctr != 0;
    lp_level = (s->regs[R_ISTR] & s->regs[R_CNTR] & 0x7f80) ||
               (low_ctr && (s->regs[R_CNTR] & R_CNTR_CTRM_MASK));
    qemu_set_irq(s->hp_irq, hp_level);
    qemu_set_irq(s->lp_irq, lp_level);
}

static void stm32g474_usbfs_qtest_set_ctr(Object *obj, Visitor *v,
                                          const char *name, void *opaque,
                                          Error **errp)
{
    Stm32g474UsbFsState *s = STM32G474_USBFS(obj);
    uint32_t value;
    uint32_t ctr;
    unsigned int ep;

    if (!visit_type_uint32(v, name, &value, errp)) {
        return;
    }

    ep = extract32(value, USBFS_QTEST_CTR_EP_SHIFT,
                   USBFS_QTEST_CTR_EP_LENGTH);
    ctr = value & USBFS_EPR_CTR_MASK;
    if (!ctr || value & ~(USBFS_EPR_CTR_MASK |
                          MAKE_64BIT_MASK(USBFS_QTEST_CTR_EP_SHIFT,
                                          USBFS_QTEST_CTR_EP_LENGTH))) {
        error_setg(errp, "%s: invalid endpoint completion 0x%x",
                   TYPE_STM32G474_USBFS, value);
        return;
    }
    if (s->resetting || s->peripheral_reset_asserted ||
        stm32g474_usbfs_fres_asserted(s) ||
        !stm32g474_usbfs_clocks_valid(s)) {
        return;
    }

    s->regs[stm32g474_usbfs_ep_regs[ep]] |= ctr;
    stm32g474_usbfs_update_irqs(s);
}

static bool stm32g474_usbfs_btable_valid(Stm32g474UsbFsState *s)
{
    uint32_t btable = s->regs[R_BTABLE] & R_BTABLE_TABLE_MASK;

    return btable <= STM32G474_USBFS_PMA_SIZE - USBFS_BDT_WINDOW_SIZE;
}

