zevorn/qemu/hw/usb/stm32g474_usbfs.c
static void stm32g474_usbfs_rebind_bdt(Stm32g474UsbFsState *s)
{
    uint32_t btable = s->regs[R_BTABLE] & R_BTABLE_TABLE_MASK;

    if (!stm32g474_usbfs_btable_valid(s)) {
        return;
    }

    for (unsigned int i = 0; i < STM32G474_USBFS_NUM_BDT_REGS; i++) {
        s->bdt_regs[i].data = &s->pma[btable / sizeof(uint16_t) + i];
    }
}

static void stm32g474_usbfs_bus_reset(Stm32g474UsbFsState *s)
{
    for (unsigned int ep = 0; ep < USBFS_NUM_ENDPOINTS; ep++) {
        unsigned int reg = stm32g474_usbfs_ep_regs[ep];

        s->regs[reg] &= USBFS_EPR_CTR_MASK;
    }
    s->regs[R_DADDR] = 0;
    s->regs[R_ISTR] |= R_ISTR_RESET_MASK;
    stm32g474_usbfs_update_irqs(s);
}

static bool stm32g474_usbfs_apply_pending_fres(
    Stm32g474UsbFsState *s)
{
    if (!s->fres_reset_pending ||
        !stm32g474_usbfs_fres_asserted(s) ||
        !stm32g474_usbfs_clocks_valid(s)) {
        return false;
    }

    s->fres_reset_pending = false;
    stm32g474_usbfs_bus_reset(s);
    return true;
}

static uint64_t stm32g474_usbfs_epr_pre_write(RegisterInfo *reg,
                                               uint64_t val)
{
    uint32_t old = *(uint32_t *)reg->data;
    uint32_t ctr = old & val & USBFS_EPR_CTR_MASK;
    uint32_t toggle = (old ^ val) & USBFS_EPR_TOGGLE_MASK;
    uint32_t setup = old & R_EP0R_SETUP_MASK;
    uint32_t rw = val & USBFS_EPR_RW_MASK;

    return ctr | toggle | setup | rw;
}

static void stm32g474_usbfs_epr_post_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474UsbFsState *s = STM32G474_USBFS(reg->opaque);

    stm32g474_usbfs_update_irqs(s);
}

static uint64_t stm32g474_usbfs_istr_pre_write(RegisterInfo *reg,
                                                uint64_t val)
{
    uint32_t old = *(uint32_t *)reg->data;
    uint32_t status = old & val & USBFS_ISTR_STATUS_MASK;

    return status | (old & USBFS_ISTR_DERIVED_MASK);
}

static void stm32g474_usbfs_istr_post_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474UsbFsState *s = STM32G474_USBFS(reg->opaque);

    stm32g474_usbfs_update_irqs(s);
}

static void stm32g474_usbfs_cntr_post_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474UsbFsState *s = STM32G474_USBFS(reg->opaque);
    bool fres = (val & R_CNTR_FRES_MASK) != 0;

    if (s->resetting) {
        s->fres_active = fres;
        return;
    }

    if (val & R_CNTR_L1RESUME_MASK) {
        qemu_log_mask(LOG_UNIMP,
                      TYPE_STM32G474_USBFS
                      ": L1 resume signaling is not implemented\n");
        s->regs[R_CNTR] &= ~R_CNTR_L1RESUME_MASK;
    }
    if (val & R_CNTR_RESUME_MASK) {
        qemu_log_mask(LOG_UNIMP,
                      TYPE_STM32G474_USBFS
                      ": resume signaling is not implemented\n");
    }

    if (!s->fres_active && fres) {
        s->fres_reset_pending = true;
    } else if (!fres) {
        s->fres_reset_pending = false;
    }
    s->fres_active = fres;
    if (!stm32g474_usbfs_apply_pending_fres(s)) {
        stm32g474_usbfs_update_irqs(s);
    }
}

static void stm32g474_usbfs_btable_post_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474UsbFsState *s = STM32G474_USBFS(reg->opaque);

    stm32g474_usbfs_rebind_bdt(s);
}

#define USBFS_EP_ACCESS(_ep) \
    { \
        .name = "EP" #_ep "R", \
        .addr = A_EP ## _ep ## R, \
        .reset = 0, \
        .ro = R_EP0R_SETUP_MASK, \
        .rsvd = 0xffff0000, \
        .pre_write = stm32g474_usbfs_epr_pre_write, \
        .post_write = stm32g474_usbfs_epr_post_write, \
    }

static const RegisterAccessInfo stm32g474_usbfs_regs_info[] = {
    USBFS_EP_ACCESS(0),
    USBFS_EP_ACCESS(1),
    USBFS_EP_ACCESS(2),
    USBFS_EP_ACCESS(3),
    USBFS_EP_ACCESS(4),
    USBFS_EP_ACCESS(5),
    USBFS_EP_ACCESS(6),
    USBFS_EP_ACCESS(7),
    {
        .name = "CNTR",
        .addr = A_CNTR,
        .reset = 0x0003,
        .rsvd = 0xffff0040,
        .post_write = stm32g474_usbfs_cntr_post_write,
    }, {
        .name = "ISTR",
        .addr = A_ISTR,
        .ro = USBFS_ISTR_DERIVED_MASK,
        .rsvd = 0xffff0060,
        .pre_write = stm32g474_usbfs_istr_pre_write,
        .post_write = stm32g474_usbfs_istr_post_write,
    }, {
        .name = "FNR",
        .addr = A_FNR,
        .ro = 0x0000ffff,
        .rsvd = 0xffff0000,
    }, {
        .name = "DADDR",
        .addr = A_DADDR,
        .rsvd = 0xffffff00,
    }, {
        .name = "BTABLE",
        .addr = A_BTABLE,
        .rsvd = 0xffff0007,
        .post_write = stm32g474_usbfs_btable_post_write,
    }, {
        .name = "LPMCSR",
        .addr = A_LPMCSR,
        .ro = USBFS_LPMCSR_LINK_MASK,
        .rsvd = 0xffffff04,
    }, {
        .name = "BCDR",
        .addr = A_BCDR,
        .ro = USBFS_BCDR_PHY_MASK,
        .rsvd = 0xffff7f00,
    },
};

#undef USBFS_EP_ACCESS

#define USBFS_BDT_ADDR_TX_ACCESS(_ep) \
    { \
        .name = "EP" #_ep "_ADDR_TX", \
        .addr = (_ep) * 8, \
        .rsvd = 0x0001, \
    }
#define USBFS_BDT_COUNT_TX_ACCESS(_ep) \
    { \
        .name = "EP" #_ep "_COUNT_TX", \
        .addr = (_ep) * 8 + 2, \
    }
#define USBFS_BDT_ADDR_RX_ACCESS(_ep) \
    { \
        .name = "EP" #_ep "_ADDR_RX", \
        .addr = (_ep) * 8 + 4, \
        .rsvd = 0x0001, \
    }
#define USBFS_BDT_COUNT_RX_ACCESS(_ep) \
    { \
        .name = "EP" #_ep "_COUNT_RX", \
        .addr = (_ep) * 8 + 6, \
        .ro = 0x03ff, \
    }

static const RegisterAccessInfo stm32g474_usbfs_bdt_info[] = {
    USBFS_BDT_ADDR_TX_ACCESS(0),
    USBFS_BDT_COUNT_TX_ACCESS(0),
    USBFS_BDT_ADDR_RX_ACCESS(0),
    USBFS_BDT_COUNT_RX_ACCESS(0),
    USBFS_BDT_ADDR_TX_ACCESS(1),
    USBFS_BDT_COUNT_TX_ACCESS(1),
    USBFS_BDT_ADDR_RX_ACCESS(1),
    USBFS_BDT_COUNT_RX_ACCESS(1),
    USBFS_BDT_ADDR_TX_ACCESS(2),
    USBFS_BDT_COUNT_TX_ACCESS(2),
    USBFS_BDT_ADDR_RX_ACCESS(2),
    USBFS_BDT_COUNT_RX_ACCESS(2),
    USBFS_BDT_ADDR_TX_ACCESS(3),
    USBFS_BDT_COUNT_TX_ACCESS(3),
    USBFS_BDT_ADDR_RX_ACCESS(3),
    USBFS_BDT_COUNT_RX_ACCESS(3),
    USBFS_BDT_ADDR_TX_ACCESS(4),
    USBFS_BDT_COUNT_TX_ACCESS(4),
    USBFS_BDT_ADDR_RX_ACCESS(4),
    USBFS_BDT_COUNT_RX_ACCESS(4),
    USBFS_BDT_ADDR_TX_ACCESS(5),
    USBFS_BDT_COUNT_TX_ACCESS(5),
    USBFS_BDT_ADDR_RX_ACCESS(5),
    USBFS_BDT_COUNT_RX_ACCESS(5),
    USBFS_BDT_ADDR_TX_ACCESS(6),
    USBFS_BDT_COUNT_TX_ACCESS(6),
    USBFS_BDT_ADDR_RX_ACCESS(6),
    USBFS_BDT_COUNT_RX_ACCESS(6),
    USBFS_BDT_ADDR_TX_ACCESS(7),
    USBFS_BDT_COUNT_TX_ACCESS(7),
    USBFS_BDT_ADDR_RX_ACCESS(7),
    USBFS_BDT_COUNT_RX_ACCESS(7),
};

