zevorn/qemu/hw/usb/stm32g474_usbfs.c
#undef USBFS_BDT_COUNT_RX_ACCESS
#undef USBFS_BDT_ADDR_RX_ACCESS
#undef USBFS_BDT_COUNT_TX_ACCESS
#undef USBFS_BDT_ADDR_TX_ACCESS

G_STATIC_ASSERT(ARRAY_SIZE(stm32g474_usbfs_regs_info) == 15);
G_STATIC_ASSERT(ARRAY_SIZE(stm32g474_usbfs_bdt_info) ==
                STM32G474_USBFS_NUM_BDT_REGS);
G_STATIC_ASSERT(STM32G474_USBFS_NUM_REGS == R_BCDR + 1);

static void stm32g474_usbfs_regs_write(void *opaque, hwaddr addr,
                                       uint64_t value, unsigned int size)
{
    RegisterInfoArray *reg_array = opaque;
    Stm32g474UsbFsState *s =
        STM32G474_USBFS(register_array_get_owner(reg_array));
    bool cntr_access = addr >= A_CNTR &&
                       addr + size <= A_CNTR + sizeof(uint32_t);

    /*
     * RM0440 45.6.1: FRES holds the USB peripheral in reset until cleared.
     * CNTR remains writable so software can release that reset.
     */
    if (s->resetting || s->peripheral_reset_asserted ||
        (stm32g474_usbfs_fres_asserted(s) && !cntr_access)) {
        return;
    }
    register_write_memory(opaque, addr, value, size);
}

static const MemoryRegionOps stm32g474_usbfs_regs_ops = {
    .read = register_read_memory,
    .write = stm32g474_usbfs_regs_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 2,
        .max_access_size = 4,
        .unaligned = false,
    },
    .impl = {
        .min_access_size = 2,
        .max_access_size = 4,
        .unaligned = false,
    },
};

static bool stm32g474_usbfs_pma_valid(hwaddr addr, unsigned int size)
{
    bool valid_size = size == 1 || size == 2;

    if (!valid_size || (addr & (size - 1)) ||
        addr > STM32G474_USBFS_PMA_SIZE - size) {
        qemu_log_mask(LOG_GUEST_ERROR,
                      TYPE_STM32G474_USBFS
                      ": invalid PMA access at 0x%" HWADDR_PRIx
                      " of size %u\n", addr, size);
        return false;
    }
    return true;
}

static bool stm32g474_usbfs_pma_is_bdt(Stm32g474UsbFsState *s,
                                        hwaddr addr, unsigned int size)
{
    uint32_t btable = s->regs[R_BTABLE] & R_BTABLE_TABLE_MASK;

    return stm32g474_usbfs_btable_valid(s) &&
           addr >= btable &&
           addr + size <= btable + USBFS_BDT_WINDOW_SIZE;
}

static uint64_t stm32g474_usbfs_pma_read(void *opaque, hwaddr addr,
                                         unsigned int size)
{
    Stm32g474UsbFsState *s = STM32G474_USBFS(opaque);
    unsigned int shift = (addr & 1) * 8;
    uint64_t mask = MAKE_64BIT_MASK(shift, size * 8);
    uint16_t value;

    if (!stm32g474_usbfs_pma_valid(addr, size)) {
        return 0;
    }

    if (stm32g474_usbfs_pma_is_bdt(s, addr, size)) {
        uint32_t btable = s->regs[R_BTABLE] & R_BTABLE_TABLE_MASK;
        unsigned int index = (addr - btable) / sizeof(uint16_t);

        value = register_read(&s->bdt_regs[index], mask,
                              TYPE_STM32G474_USBFS, false);
    } else {
        value = s->pma[addr / sizeof(uint16_t)];
    }

    return extract32(value, shift, size * 8);
}

static void stm32g474_usbfs_pma_write(void *opaque, hwaddr addr,
                                      uint64_t value, unsigned int size)
{
    Stm32g474UsbFsState *s = STM32G474_USBFS(opaque);
    unsigned int shift = (addr & 1) * 8;
    uint64_t mask = MAKE_64BIT_MASK(shift, size * 8);
    uint16_t lane_value = (value << shift) & mask;

    if (!stm32g474_usbfs_pma_valid(addr, size) ||
        s->resetting || s->peripheral_reset_asserted) {
        return;
    }

    if (stm32g474_usbfs_pma_is_bdt(s, addr, size)) {
        uint32_t btable = s->regs[R_BTABLE] & R_BTABLE_TABLE_MASK;
        unsigned int index = (addr - btable) / sizeof(uint16_t);

        register_write(&s->bdt_regs[index], lane_value, mask,
                       TYPE_STM32G474_USBFS, false);
    } else {
        unsigned int index = addr / sizeof(uint16_t);

        s->pma[index] = (s->pma[index] & ~mask) | lane_value;
    }
}

static const MemoryRegionOps stm32g474_usbfs_pma_ops = {
    .read = stm32g474_usbfs_pma_read,
    .write = stm32g474_usbfs_pma_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 1,
        .max_access_size = 2,
        .unaligned = false,
    },
    .impl = {
        .min_access_size = 1,
        .max_access_size = 2,
        .unaligned = false,
    },
};

static void stm32g474_usbfs_reset_registers(Stm32g474UsbFsState *s)
{
    memset(s->regs, 0, sizeof(s->regs));
    memset(s->pma, 0, sizeof(s->pma));

    for (unsigned int i = 0;
         i < ARRAY_SIZE(stm32g474_usbfs_regs_info); i++) {
        const RegisterAccessInfo *access = &stm32g474_usbfs_regs_info[i];

        register_reset(&s->regs_info[access->addr / sizeof(uint32_t)]);
    }

    stm32g474_usbfs_rebind_bdt(s);
    s->fres_active = (s->regs[R_CNTR] & R_CNTR_FRES_MASK) != 0;
    s->fres_reset_pending = false;
}

static void stm32g474_usbfs_reset_input(void *opaque, int n, int level)
{
    Stm32g474UsbFsState *s = STM32G474_USBFS(opaque);
    bool asserted = level != 0;
    bool was_resetting;

    if (asserted == s->peripheral_reset_asserted) {
        return;
    }

    s->peripheral_reset_asserted = asserted;
    if (asserted) {
        was_resetting = s->resetting;
        s->resetting = true;
        stm32g474_usbfs_reset_registers(s);
        qemu_set_irq(s->hp_irq, 0);
        qemu_set_irq(s->lp_irq, 0);
        s->resetting = was_resetting;
    } else if (!s->resetting) {
        stm32g474_usbfs_update_irqs(s);
    }
}

static void stm32g474_usbfs_reset_enter(Object *obj, ResetType type)
{
    Stm32g474UsbFsState *s = STM32G474_USBFS(obj);

    s->resetting = true;
}

static void stm32g474_usbfs_reset_hold(Object *obj, ResetType type)
{
    Stm32g474UsbFsState *s = STM32G474_USBFS(obj);

    stm32g474_usbfs_reset_registers(s);
    s->peripheral_reset_asserted = false;
    qemu_set_irq(s->hp_irq, 0);
    qemu_set_irq(s->lp_irq, 0);
}

static void stm32g474_usbfs_reset_exit(Object *obj, ResetType type)
{
    Stm32g474UsbFsState *s = STM32G474_USBFS(obj);

    s->resetting = false;
    stm32g474_usbfs_update_irqs(s);
}

static bool stm32g474_usbfs_fixed_slot_defined(unsigned int slot)
{
    for (unsigned int i = 0;
         i < ARRAY_SIZE(stm32g474_usbfs_regs_info); i++) {
        if (stm32g474_usbfs_regs_info[i].addr / sizeof(uint32_t) == slot) {
            return true;
        }
    }
    return false;
}

static bool stm32g474_usbfs_migration_valid(Stm32g474UsbFsState *s)
{
    for (unsigned int i = 0; i < STM32G474_USBFS_NUM_REGS; i++) {
        if (!stm32g474_usbfs_fixed_slot_defined(i) && s->regs[i]) {
            return false;
        }
    }

    for (unsigned int i = 0;
         i < ARRAY_SIZE(stm32g474_usbfs_regs_info); i++) {
        const RegisterAccessInfo *access = &stm32g474_usbfs_regs_info[i];
        uint32_t value = s->regs[access->addr / sizeof(uint32_t)];

