zevorn/qemu/hw/usb/stm32g474_usbfs.c
        if (value & access->rsvd) {
            return false;
        }
    }

    return s->regs[R_FNR] == 0 &&
           !(s->regs[R_LPMCSR] & USBFS_LPMCSR_LINK_MASK) &&
           !(s->regs[R_BCDR] & USBFS_BCDR_PHY_MASK) &&
           !(s->regs[R_CNTR] & R_CNTR_L1RESUME_MASK) &&
           (!s->fres_reset_pending ||
            (stm32g474_usbfs_fres_asserted(s) &&
             !stm32g474_usbfs_clocks_valid(s)));
}

static int stm32g474_usbfs_post_load(void *opaque, int version_id)
{
    Stm32g474UsbFsState *s = STM32G474_USBFS(opaque);

    if (!stm32g474_usbfs_migration_valid(s)) {
        return -EINVAL;
    }

    s->resetting = true;
    if (s->peripheral_reset_asserted) {
        stm32g474_usbfs_reset_registers(s);
    } else {
        stm32g474_usbfs_rebind_bdt(s);
    }
    s->fres_active = (s->regs[R_CNTR] & R_CNTR_FRES_MASK) != 0;
    s->resetting = false;
    stm32g474_usbfs_update_irqs(s);
    return 0;
}

static void stm32g474_usbfs_clock_update(void *opaque, ClockEvent event)
{
    Stm32g474UsbFsState *s = STM32G474_USBFS(opaque);

    if (!stm32g474_usbfs_apply_pending_fres(s)) {
        stm32g474_usbfs_update_irqs(s);
    }
}

static const VMStateDescription vmstate_stm32g474_usbfs = {
    .name = TYPE_STM32G474_USBFS,
    .version_id = 1,
    .minimum_version_id = 1,
    .post_load = stm32g474_usbfs_post_load,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT32_ARRAY(regs, Stm32g474UsbFsState,
                             STM32G474_USBFS_NUM_REGS),
        VMSTATE_UINT16_ARRAY(pma, Stm32g474UsbFsState,
                             STM32G474_USBFS_PMA_SIZE / sizeof(uint16_t)),
        VMSTATE_BOOL(peripheral_reset_asserted, Stm32g474UsbFsState),
        VMSTATE_BOOL(fres_reset_pending, Stm32g474UsbFsState),
        VMSTATE_CLOCK(pclk, Stm32g474UsbFsState),
        VMSTATE_CLOCK(usb, Stm32g474UsbFsState),
        VMSTATE_END_OF_LIST()
    },
};

static void stm32g474_usbfs_realize(DeviceState *dev, Error **errp)
{
    Stm32g474UsbFsState *s = STM32G474_USBFS(dev);

    if (!clock_has_source(s->pclk)) {
        error_setg(errp, TYPE_STM32G474_USBFS
                   ": pclk clock must be connected");
        return;
    }
    if (!clock_has_source(s->usb)) {
        error_setg(errp, TYPE_STM32G474_USBFS
                   ": usb clock must be connected");
    }
}

static void stm32g474_usbfs_init(Object *obj)
{
    Stm32g474UsbFsState *s = STM32G474_USBFS(obj);
    DeviceState *dev = DEVICE(obj);

    s->reg_array = register_init_block32(
        dev, stm32g474_usbfs_regs_info,
        ARRAY_SIZE(stm32g474_usbfs_regs_info), s->regs_info, s->regs,
        &stm32g474_usbfs_regs_ops, false, STM32G474_USBFS_MMIO_SIZE);
    sysbus_init_mmio(SYS_BUS_DEVICE(obj), &s->reg_array->mem);

    memory_region_init_io(&s->pma_mr, obj, &stm32g474_usbfs_pma_ops, s,
                          TYPE_STM32G474_USBFS ".pma",
                          STM32G474_USBFS_PMA_SIZE);
    sysbus_init_mmio(SYS_BUS_DEVICE(obj), &s->pma_mr);

    for (unsigned int i = 0; i < STM32G474_USBFS_NUM_BDT_REGS; i++) {
        s->bdt_regs[i] = (RegisterInfo) {
            .data = &s->pma[i],
            .data_size = sizeof(uint16_t),
            .access = &stm32g474_usbfs_bdt_info[i],
            .opaque = s,
        };
    }

    sysbus_init_irq(SYS_BUS_DEVICE(obj), &s->hp_irq);
    sysbus_init_irq(SYS_BUS_DEVICE(obj), &s->lp_irq);
    s->pclk = qdev_init_clock_in(dev, "pclk",
                                 stm32g474_usbfs_clock_update,
                                 s, ClockUpdate);
    s->usb = qdev_init_clock_in(dev, "usb",
                                stm32g474_usbfs_clock_update,
                                s, ClockUpdate);
    qdev_init_gpio_in_named(dev, stm32g474_usbfs_reset_input, "reset", 1);

    if (qtest_enabled()) {
        object_property_add(obj, "qtest-set-ctr", "uint32", NULL,
                            stm32g474_usbfs_qtest_set_ctr, NULL, NULL);
    }
}

static void stm32g474_usbfs_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);
    ResettableClass *rc = RESETTABLE_CLASS(klass);

    dc->realize = stm32g474_usbfs_realize;
    dc->vmsd = &vmstate_stm32g474_usbfs;
    dc->user_creatable = false;
    rc->phases.enter = stm32g474_usbfs_reset_enter;
    rc->phases.hold = stm32g474_usbfs_reset_hold;
    rc->phases.exit = stm32g474_usbfs_reset_exit;
}

static const TypeInfo stm32g474_usbfs_info = {
    .name = TYPE_STM32G474_USBFS,
    .parent = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(Stm32g474UsbFsState),
    .instance_init = stm32g474_usbfs_init,
    .class_init = stm32g474_usbfs_class_init,
};

static void stm32g474_usbfs_register_types(void)
{
    type_register_static(&stm32g474_usbfs_info);
}

type_init(stm32g474_usbfs_register_types)
